import React from 'react';
import './HistoryPage.css';

export default function HistoryPage() {
  const stats = [
  {
    label: "Всього поїздок",
    value: 240,
    icon: "directions_car",
    color: "#2db7d2"
  },
  {
    label: "Завершених",
    value: 183,
    icon: "check_circle",
    color: "#00ca80"
  },
  {
    label: "Скасовано",
    value: 57,
    icon: "cancel",
    color: "#BB271A"
  }
];
  
  const trips = [
    {
      id: 1,
      date: '27 черв. 2026 г., 23:20',
      from: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      to: 'Київ, Каховська вулиця, 62А',
      price: '890 ₴',
      status: 'ВИКОНАНО'
    },
    {
      id: 2,
      date: '26 черв. 2026 г., 22:46',
      from: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      to: 'Київ, Каховська вулиця, 62А',
      price: '765 ₴',
      status: 'ВИКОНАНО'
    },
    {
      id: 3,
      date: '21 черв. 2026 г., 23:19',
      from: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      to: 'Київ, Каховська вулиця, 62А',
      price: '880 ₴',
      status: 'ВИКОНАНО'
    },
    {
      id: 4,
      date: '20 черв. 2026 г., 23:08',
      from: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      to: 'Київ, Каховська вулиця, 62А',
      price: '960 ₴',
      status: 'ВИКОНАНО'
    },
    {
      id: 5,
      date: '20 черв. 2026 г., 23:08',
      from: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      to: 'Київ, Каховська вулиця, 62А',
      price: '710 ₴',
      status: 'ВИКОНАНО'
    },
    {
      id: 6,
      date: '4 черв. 2026 г., 22:19',
      from: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      to: 'Київ, Каховська вулиця, 62А',
      price: '666 ₴',
      status: 'ВИКОНАНО'
    },
    {
      id: 8,
      date: '4 черв. 2026 г., 22:19',
      from: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      to: 'Київ, Каховська вулиця, 62А',
      price: '777 ₴',
      status: 'ВИКОНАНО'
    },
    {
      id: 9,
      date: '4 черв. 2026 г., 22:19',
      from: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      to: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      price: '999 ₴',
      status: 'ВИКОНАНО'
    },
    {
      id: 10,
      date: '4 черв. 2026 г., 22:19',
      from: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      to: 'Паркінг ВДНГ (Київ, Академіка Глушкова проспект)',
      price: '101010 ₴',
      status: 'ВИКОНАНО'
    }
  ];

  return (
    <div className="history-page">
      {/* Сетка статистики */}
      <div className="stats-grid">
        {stats.map((item, i) => (
          <div key={i} className="stat-card">
<div className="stat-header">
  <span>{item.label}</span>
  <span>{item.icon}</span>
</div>
            <h2>{item.value}</h2>
          </div>
        ))}
      </div>

      {/* Список поездок */}
      <div className="trips-list">
        {trips.map((trip) => (
          <div key={trip.id} className="trip-card">
            <div className="trip-card-header">
              <span className="trip-date">{trip.date}</span>
              <button className="more-btn">⋮</button>
            </div>

            <div className="route-container">
              <div className="route-line">
                <div className="dot yellow"></div>
                <div className="line"></div>
                <div className="dot white"></div>
              </div>
              <div className="route-addresses">
                <p className="address">{trip.from}</p>
                <p className="address">{trip.to}</p>
              </div>
            </div>

            <div className="trip-footer">
              <div className="price-box">
                <span className="price">{trip.price}</span>
                <span className="pay-method"><svg version="1.1" id="Слой_1" focusable="false" xmlns="http://www.w3.org/2000/svg" xmlns:xlink="http://www.w3.org/1999/xlink" x="0px" y="0px" viewBox="0 0 612 792">
  <g>
    <path fill="#FFFFFF" d="M229.5,491.8l78.2-274.7c-48.5,3.1-96,4.4-96,4.4L206.5,553l155,2.2l-114.2-32.8C234.6,517.3,226.9,504.5,229.5,491.8z"/>
    <path fill="#FFFFFF" d="M68.8,320.9l79.1,321.3L295.8,604l-117.3-2.5c-15.3,0-25.5-10.2-25.5-25.5l5.7-287.4c-17.4,10-35.6,18.5-41.4,19.6L68.8,320.9z"/>
    <path fill="#FFFFFF" d="M438.6,354.1c2.5-10.2-5.1-17.8-15.3-22.9c-2.5-2.5-5.1-2.5-7.7-2.5c-1.5,0-3.9,0-6.2,0.5v33.3c1.2,0.6,2.4,1.2,3.6,1.9C423.3,366.8,436,361.7,438.6,354.1z"/>
    <path fill="#FFFFFF" d="M360.5,134.7L262,481.3c0,0,17.3,14.8,44,22.7s143.5,32.4,143.5,32.4l53.8-64.5c0,0,41.8-173.6,44.9-183.5c3.1-9.9,8.4-87.2,8.4-87.2L360.5,134.7z"/>
    <path fill="#454754" d="M415.6,328.6c2.6,0,5.1,0,7.7,2.5c10.2,5.1,17.8,12.7,15.3,22.9c-2.6,7.6-15.3,12.8-25.5,10.2c-1.2-0.6-2.4-1.2-3.6-1.9v52.4c3.5,0.4,7,0.4,11.3,0.4c30.6,0,58.6-20.4,66.3-51c10.2-35.7-12.8-73.9-51-84.1c-8.5-2.4-17.7-3.1-26.6-2.3v51.3C411.7,328.6,414.1,328.6,415.6,328.6z"/>
    <path opacity="0.6" fill="#008C4F" d="M415.6,328.6c2.6,0,5.1,0,7.7,2.5c10.2,5.1,17.8,12.7,15.3,22.9c-2.6,7.6-15.3,12.8-25.5,10.2c-1.2-0.6-2.4-1.2-3.6-1.9v52.4c3.5,0.4,7,0.4,11.3,0.4c30.6,0,58.6-20.4,66.3-51c10.2-35.7-12.8-73.9-51-84.1c-8.5-2.4-17.7-3.1-26.6-2.3v51.3C411.7,328.6,414.1,328.6,415.6,328.6z"/>
    <path fill="#454754" d="M349.3,326c-5.1,17.8-2.5,38.2,7.7,53.5c3.6,5.4,7.8,10.1,12.6,14.4c1.6-35.8,3.2-71.9,4.6-103.6C362.7,298.7,353.5,311.5,349.3,326z"/>
    <path opacity="0.6" fill="#008C4F" d="M349.3,326c-5.1,17.8-2.5,38.2,7.7,53.5c3.6,5.4,7.8,10.1,12.6,14.4c1.6-35.8,3.2-71.9,4.6-103.6C362.7,298.7,353.5,311.5,349.3,326z"/>
    <path fill="#454754" d="M363.2,555.6l-1.6-0.5l-155-2.2l5.1-331.5c0,0,47.6-1.3,96-4.4l12.6-44.1l-134.1-5c-15.3,0-25.5,10.2-25.5,25.5l-1.1,56c18.7-1.5,35.3-0.7,36.5,6.4c2.8,6.9-16.7,20.9-37.3,32.7L153,575.9c0,15.3,10.2,25.5,25.5,25.5l117.3,2.5l-147.9,38.3L68.8,320.9l48.5-12.8c5.9-1.2,24-9.6,41.4-19.6l0.8-39.1c-21.4,1.7-45.6,6.3-52.4,7.7l-73.9,20.4c-7.7,0-12.8,5.1-17.9,10.2c-2.5,5.1-2.5,12.8-2.5,20.4l91.8,372.3c2.5,12.8,12.8,20.4,25.5,20.4c2.5,0,5.1,0,5.1,0L334,652.4c12.8-2.6,23-17.8,17.9-30.6c0-5.1-5.1-7.7-7.7-12.8h38.3c12.7,0,25.5-10.2,25.5-25.4c-7.7,0.4-42.3,2.2-45,2.5C362.5,586.2,362.6,574.7,363.2,555.6z"/>
    <path opacity="0.6" fill="#147245" d="M363.2,555.6l-1.6-0.5l-155-2.2l5.1-331.5c0,0,47.6-1.3,96-4.4l12.6-44.1l-134.1-5c-15.3,0-25.5,10.2-25.5,25.5l-1.1,56c18.7-1.5,35.3-0.7,36.5,6.4c2.8,6.9-16.7,20.9-37.3,32.7L153,575.9c0,15.3,10.2,25.5,25.5,25.5l117.3,2.5l-147.9,38.3L68.8,320.9l48.5-12.8c5.9-1.2,24-9.6,41.4-19.6l0.8-39.1c-21.4,1.7-45.6,6.3-52.4,7.7l-73.9,20.4c-7.7,0-12.8,5.1-17.9,10.2c-2.5,5.1-2.5,12.8-2.5,20.4l91.8,372.3c2.5,12.8,12.8,20.4,25.5,20.4c2.5,0,5.1,0,5.1,0L334,652.4c12.8-2.6,23-17.8,17.9-30.6c0-5.1-5.1-7.7-7.7-12.8h38.3c12.7,0,25.5-10.2,25.5-25.4c4.8-14.9-6-37.7-18.2-25.6c-0.2,0.2-11.2,4.3-13.6-2.8C374.2,548.9,367.4,554.6,363.2,555.6z"/>
    <path fill="#454754" d="M196,255.9c-1.2-7.1-17.8-7.9-36.5-6.4l-0.8,39.1C179.3,276.7,198.8,262.8,196,255.9z"/>
    <path opacity="0.6" fill="#147245" d="M196,255.9c-1.2-7.1-17.8-7.9-36.5-6.4l-0.8,39.1C179.3,276.7,198.8,262.8,196,255.9z"/>
    <path fill="#454754" d="M586.1,170.4l-221.9-63.7c-12.8-2.5-25.5,5.1-30.6,17.8l-13.8,48.4l53.6,2l3.5-12.2l170.9,48.4l-91.8,318.7l-46.9-13.3v52.3l59.7,17.2c2.6,0,5.1,0,7.7,0c2.6,0,7.7,0,10.2,0c7.6-2.5,10.2-7.6,12.8-15.3L604,203.5c2.6-7.7,0-15.3-2.5-20.4C598.9,175.5,593.8,172.9,586.1,170.4z"/>
    <path fill="#454754" d="M363.1,212.5c-16.6,1.8-36.1,3.4-55.4,4.6l-78.2,274.7c-2.5,12.8,5.1,25.5,17.9,30.6l114.2,32.8l1.6,0
c0.4-13.7,1-31.2,1.8-51.1l-79.4-22.5L363.1,212.5z"/>
    <path fill="#454754" d="M363.1,212.5l10.8-37.5l-53.6-2l-12.6,44.1C327,215.9,346.4,214.3,363.1,212.5z"/>
    <path fill="#454754" d="M363.2,555.6c0-0.1,0-0.3,0-0.4l-1.6,0L363.2,555.6z"/>
    <path fill="#FFFFFF" d="M405.5,331.1c-2.5,0-7.7,5.1-7.7,10.2c-2.5,5.1,0,10.2,2.5,12.7c1.9,3.9,5.4,6.3,9.1,8.3v-33.3C408,329.5,406.5,330.1,405.5,331.1z"/>
    <path fill="#454754" d="M408,583.6C408,583.6,408,583.6,408,583.6c1,0,1.5,0,1.5,0V569l-3.6-1C408.1,572.4,409,577.8,408,583.6z"/>
    <path fill="#FFFFFF" d="M377.4,162.8l-3.5,12.2l10.1,0.4c10.1,0,18,4.4,22.2,11.9h3.3v13.6c0,3.9-12.7,7.1-31.6,9.8c-4.6,0.6-9.6,1.3-14.8,1.8l-77.5,269.1l79.4,22.5l44.5,12.6l46.9,13.3l91.8-318.7L377.4,162.8z M420.8,415.3c-4.2,0-7.7,0-11.3-0.4c-2.8-0.3-5.7-1-9.1-2.1c-11.6-5-22.1-11-30.8-18.8c-4.7-4.2-9-9-12.6-14.4c-10.2-15.3-12.8-35.7-7.7-53.5c4.1-14.5,13.3-27.3,24.9-35.7c2.7-1.9,5.4-3.6,8.3-5.1c8-4,17.3-6.6,27-7.4c8.9-0.8,18-0.1,26.6,2.3c38.3,10.2,61.2,48.5,51,84.1</span>
              </div>
              <span className="status-badge">{trip.status}</span>
            </div>

            <div className="trip-actions">
              <button className="action-btn">В зворотній бік</button>
              <button className="action-btn">Повторити</button>
            </div>
          </div>
        ))}
      </div>
    </div>
  );
}
